@rem #######################################################################
@rem                       文件描述：启动批处理文件
@rem                       系统名称：TS提醒工具（对接钉钉）
@rem                       建立日期：2017/06/05
@rem                       修改日期：2017/06/07
@rem #######################################################################
@rem                       系统需要个性化配置环境变量
@rem #######################################################################

@echo off
title TS提醒工具


@echo #######################################################################
@echo                       系统名称：TS提醒工具
@echo #######################################################################
@echo 系统正在启动中...

set JAVA_HOME=./jdk1.8.0_112
set PATH=%JAVA_HOME%/bin;%PATH%
set CLASSPATH=.;%JAVA_HOME%/lib/dt.jar;%JAVA_HOME%/lib/tools.jar
java -jar ts2dingding.jar
